IDENTIFICATION DIVISION.
PROGRAM-ID. BOOK-STATS.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-MAX-PAGES PIC 9(4) VALUE 0.
        01 WS-MIN-PAGES PIC 9(4) VALUE 9999.
        01 WS-SUM-PAGES PIC 9(6) VALUE 0.
        01 I         PIC 99.

LINKAGE SECTION.
    COPY "books_copybook.cpy".
    COPY "book_stats_copybook.cpy".

PROCEDURE DIVISION USING BOOKS-INPUT, BOOK-STATS.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > BOOK-COUNT
        ADD BOOK-PAGES(I) TO WS-SUM-PAGES
        IF BOOK-PAGES(I) > WS-MAX-PAGES THEN
            MOVE BOOK-PAGES(I) TO WS-MAX-PAGES
        END-IF
        IF BOOK-PAGES(I) < WS-MIN-PAGES THEN
            MOVE BOOK-PAGES(I) TO WS-MIN-PAGES
        END-IF
    END-PERFORM.

    MOVE WS-MAX-PAGES TO MAX-PAGES.
    MOVE WS-MIN-PAGES TO MIN-PAGES.
    DIVIDE WS-SUM-PAGES BY BOOK-COUNT GIVING AVG-PAGES ROUNDED.
