01 BOOKS-INPUT.
    05 BOOK-COUNT PIC 99.
    05 BOOKS OCCURS 0 TO 99 TIMES DEPENDING ON BOOK-COUNT.
        10 BOOK-TITLE    PIC X(25).
        10 BOOK-AUTHOR   PIC X(25).
        10 BOOK-PAGES    PIC 9(4).

