IDENTIFICATION DIVISION.
PROGRAM-ID. DOUBLE-HEIGHT-TEST-DRIVER.

ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
    FILE SECTION.
    FD SYSIN
        RECORDING MODE IS V
        RECORD IS VARYING IN SIZE
        FROM 0 TO 9999999.
    01  INPUT-RECORD PIC X(1).

    WORKING-STORAGE SECTION.
        COPY "books_copybook.cpy".
        COPY "book_stats_copybook.cpy".

PROCEDURE DIVISION.
main-paragraph.
    OPEN INPUT SYSIN.
    READ SYSIN INTO BOOKS-INPUT
    END-READ.
    CLOSE SYSIN.

    CALL 'BOOK-STATS' USING BOOKS-INPUT, BOOK-STATS.

    DISPLAY BOOK-STATS.
    STOP RUN.
