IDENTIFICATION DIVISION.
PROGRAM-ID. WRITE-FILE.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
   FILE-CONTROL.
   SELECT STUDENT ASSIGN TO OUT1
      ORGANIZATION IS SEQUENTIAL
      ACCESS IS SEQUENTIAL.

DATA DIVISION.
   FILE SECTION.
   FD STUDENT.
   01 STUDENT-FILE.
      05 S-STUDENT-ID PIC 9(5).
      05 S-NAME PIC A(25).
      05 S-CLASS PIC X(3).

   WORKING-STORAGE SECTION.
   01 WS-STUDENT.
      05 WS-STUDENT-ID PIC 9(5).
      05 WS-NAME PIC A(25).
      05 WS-CLASS PIC X(3).

PROCEDURE DIVISION.
   OPEN OUTPUT STUDENT.
      MOVE 1000 TO S-STUDENT-ID.
      MOVE 'Tim' TO S-NAME.
      MOVE '10' TO S-CLASS.
      WRITE STUDENT-FILE
      END-WRITE.
   CLOSE STUDENT.
STOP RUN.
