IDENTIFICATION DIVISION.
PROGRAM-ID. DISPLAY-TEXTS.

DATA DIVISION.
   LINKAGE SECTION.
   COPY "src/main/copystrecke.cpy".

PROCEDURE DIVISION USING IN-VAL1 IN-VAL2.
   DISPLAY "Passed Value 1: "IN-VAL1.
   DISPLAY "Passed Value 2: "IN-VAL2.
STOP RUN.
