IDENTIFICATION DIVISION.
PROGRAM-ID. DISPLAY-TEXTS.

DATA DIVISION.
   LINKAGE SECTION.
   01 IN-VAL1 PIC X(10).
   01 IN-VAL2 PIC X(10).

PROCEDURE DIVISION USING IN-VAL1 IN-VAL2.
   DISPLAY "Passed Value 1: "IN-VAL1.
   DISPLAY "Passed Value 2: "IN-VAL2.
STOP RUN.
