IDENTIFICATION DIVISION.
PROGRAM-ID. DOUBLE-HEIGHT.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-HEIGHT PIC 9(5).

   LINKAGE SECTION.
   COPY "src/main/copystrecke.cpy".




PROCEDURE DIVISION USING BUILDINGS.
double-all-buildings.
    PERFORM double-one-building VARYING I FROM 1 BY 1 UNTIL I > COUNT-OF-BUILDINGS.

double-one-building.
    MOVE BUILDING-HEIGHT(I) TO WS-HEIGHT.
    COMPUTE WS-HEIGHT = WS-HEIGHT * 2.
    MOVE WS-HEIGHT TO BUILDING-HEIGHT(I).
