IDENTIFICATION DIVISION.
PROGRAM-ID. DISPLAY-TEXTS.

DATA DIVISION.
   LINKAGE SECTION.
   COPY "src/main/copystrecke.cpy".

PROCEDURE DIVISION USING BUILDINGS.
   DISPLAY "Passed Value: "BUILDINGS.
STOP RUN.
